{
  "homePage": {
    "IAm": "Я",
    "Maksym": "Максим Ризнык",
    "softwareDeveloper": "РАЗРАБОТЧИК ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ",
    "textAboutMe": "Я студент и веб-разработчик с более чем трехлетним опытом создания современных веб-приложений. Специализируюсь на React, Next.js, а также на фронтенд- и бэкенд-разработке. Мои ключевые компетенции включают работу с базами данных (MongoDB, MariaDB) и создание адаптивных пользовательских интерфейсов с использованием CSS, Tailwind CSS, Material UI.",
    "download": "СКАЧАТЬ РЕЗЮМЕ"
  },
  "aboutPage": {
    "aboutPart1": "ABOUT",
    "aboutPart2": "ME",
    "personalInfo": "ЛИЧНАЯ ИНФОРМАЦИЯ",
    "name": "Имя",
    "nameContent": "Максим Ризнык",
    "age": "Возраст",
    "ageContent": "19",
    "phone": "Телефон",
    "phoneContent": "+49 1512 4108711",
    "email": "Эл. почта",
    "emailContent": "reznikmaksym14@gmail.com",
    "address": "Адрес",
    "addressContent": "Trittauer Amtsweg 51a",
    "languages": "Языки",
    "languagesContent": "Немецкий, Английский, Русский, Украинский",
    "nationality": "Национальность",
    "nationalityContent": "Украинец",

    "box1": "БОЛЬШИЕ ПРОЕКТЫ",
    "box2": "ЯЗЫКИ",
    "box3": "ТЕХНОЛОГИИ",
    "box4": "ГОДЫ ОПЫТА",
    "box5": "ГОДЫ ОБУЧЕНИЯ",

    "mySkillsPart1": "MY",
    "mySkillsPart2": "SKILLS",

    "levelAdvanced": "Продвинутый",
    "levelIntermediate": "Средний",
    "levelBeginner": "Начальный",

    "coverLetterPart1": "СОПРОВОДИТЕЛЬНОЕ",
    "coverLetterPart2": "ПИСЬМО",

    "workingExperience": "Опыт работы",
    "education": "Образование",

    "present": "Настоящее время",

    "work1PosName": "Full-Stack разработчик",
    "work1Name": "AVAIT UG",
    "work1About": "Разработка фронтенд- и бэкенд-компонентов для комплексного веб-приложения. Это включает в себя создание адаптивных пользовательских интерфейсов с использованием современных фреймворков, а также обеспечение их интеграции с серверной архитектурой. Оптимизация и настройка баз данных для эффективного хранения и извлечения данных, а также внедрение надежных мер безопасности для защиты конфиденциальной информации. Разработка функциональных элементов, таких как интерактивные формы, динамическая загрузка контента и удобная навигация, для улучшения общего пользовательского опыта.",

    "work2PosName": "Фронтенд-разработчик",
    "work2Name": "IT-TUTOR",
    "work2About": "Разработка фронтенда веб-приложения с особым акцентом на проектирование и реализацию удобных UI-компонентов, которые обеспечивают оптимальный пользовательский опыт. Особое внимание уделяется адаптивному дизайну, который позволяет адаптировать приложение для работы на смартфонах, планшетах и компьютерах с сохранением высокой функциональности и эстетики. Также реализованы механизмы для безопасной обработки данных на стороне клиента, что обеспечивает защиту данных и конфиденциальность пользователей.",

    "work3PosName": "Стажер (Фронтенд)",
    "work3Name": "Foodba",
    "work3About": "Разработка фронтенда веб-приложения с упором на создание интуитивно понятного и привлекательного интерфейса, который обеспечивает положительный пользовательский опыт. Это включает в себя проектирование и реализацию дизайна, создание единого визуального стиля и применение принципов UX. Особое внимание уделяется функциональным элементам приложения, таким как интерактивные компоненты, формы, элементы навигации и динамический контент, которые улучшают и поддерживают общую функциональность веб-приложения.",

    "edu1PosName": "Студент, Т-Курс",
    "edu1Name": "Studienkolleg Hamburg",
    "edu1About": "Окончание подготовительного колледжа с успешной сдачей вступительного экзамена (FSP), что является квалификацией для начала учебы в вузе в Германии. Т-Курс ориентирован на подготовку к будущей учебе. Знания немецкого языка углубляются до академического уровня, чтобы успешно завершить курс на немецком языке. Кроме того, уделяется большое внимание изучению основ математики, физики и информатики.",

    "edu2PosName": "Разработчик ПО",
    "edu2Name": "IT-Академия 'Step'",
    "edu2About": "Получение диплома разработчика программного обеспечения с углубленным изучением современных языков программирования и технологий. Это включает разработку веб-приложений с использованием JavaScript, HTML и CSS, программных решений на C++ и приложений на основе C# и .NET. Также изучались серверная разработка с использованием Node.js и фронтенд-разработка с Angular и React. Специализация была направлена на программирование на Java и разработку Android-приложений, что обеспечило прочные навыки для создания современных программных решений.",

    "edu3PosName": "Школьник",
    "edu3Name": "Гимназия №31, Запорожье",
    "edu3About": "Окончание школьного обучения с успешным освоением математики, естественных наук, языков и информатики. В процессе школьного обучения были развиты важные социальные и организационные навыки, которые стали основой для дальнейшей академической и профессиональной карьеры."
  },
  "projects": {
    "myProjectsPart1": "MY",
    "myProjectsPart2": "PROJECT",
    "viewProjBtn": "ПОСМОТРЕТЬ ПРОЕКТ",

    "proj1Name": "IT-Tutor",
    "proj1About": "Онлайн-сервис IT-курсов, который предлагает широкий выбор учебных материалов и интерактивных курсов по различным IT-темам. Удобная платформа помогает как новичкам, так и опытным пользователям улучшить свои технические навыки.",

    "proj2Name": "Frion",
    "proj2About": "Frion — это платформа для вымышленного приюта для животных, которая предлагает различные услуги, связанные с домашними животными. Пользователи могут регистрировать животных для усыновления, сдавать найденных животных или запрашивать лечение для своих питомцев. Сайт также предоставляет выбор товаров для животных и возможность найти ближайшие экстренные приюты. Все запросы подтверждаются через мессенджер, электронную почту или телефон. Платформа поддерживает несколько языков и предлагает удобный интерфейс для любителей животных."
  },
  "contactPage": {
    "contactMePart1": "СВЯЖИТЕСЬ",
    "contactMePart2": "СО МНОЙ",

    "getInTouch": "Связаться",
    "contactText": "Если у вас есть ко мне вопросы, оставьте свои контактные данные и сообщение в форме, и я с радостью вам отвечу! Давайте вместе превратим сложные задачи в успешные цифровые решения!",

    "fieldName": "Имя",
    "fieldNamePlacehold": "Введите ваше имя ...",

    "fieldEmail": "Эл. почта",
    "fieldEmailPlacehold": "Введите вашу почту ...",

    "fieldSubject": "Тема",
    "fieldSubjectPlacehold": "Введите тему ...",

    "fieldMessage": "Сообщение",
    "fieldMessagePlacehold": "Введите сообщение ...",

    "sendMessageBtn": "ОТПРАВИТЬ СООБЩЕНИЕ"
  }
}
