{
  "homePage": {
    "IAm": "Я",
    "Maksym": "Максим Різник",
    "softwareDeveloper": "РОЗРОБНИК ПРОГРАМНОГО ЗАБЕЗПЕЧЕННЯ",
    "textAboutMe": "Я веб-розробник з більш ніж трирічним досвідом створення сучасних веб-додатків. Спеціалізуюся на React, Next.js, а також на фронтенд- та бекенд-розробці. Мої ключові компетенції включають роботу з базами даних (MongoDB, MariaDB) та створення адаптивних інтерфейсів користувача за допомогою CSS, Tailwind CSS, Material UI.",
    "download": "ЗАВАНТАЖИТИ РЕЗЮМЕ"
  },
  "aboutPage": {
    "aboutPart1": "ABOUT",
    "aboutPart2": "ME",
    "personalInfo": "ОСОБИСТА ІНФОРМАЦІЯ",
    "name": "Ім'я",
    "nameContent": "Максим Різник",
    "age": "Вік",
    "ageContent": "19",
    "phone": "Телефон",
    "phoneContent": "+49 1512 4108711",
    "email": "Ел. пошта",
    "emailContent": "reznikmaksym14@gmail.com",
    "address": "Адреса",
    "addressContent": "Trittauer Amtsweg 51a",
    "languages": "Мови",
    "languagesContent": "Німецька, Англійська, Російська, Українська",
    "nationality": "Національність",
    "nationalityContent": "Українець",

    "box1": "ВЕЛИКІ ПРОЄКТИ",
    "box2": "МОВИ",
    "box3": "ТЕХНОЛОГІЇ",
    "box4": "РОКИ ДОСВІДУ",
    "box5": "РОКИ НАВЧАННЯ",

    "mySkillsPart1": "MY",
    "mySkillsPart2": "SKILLS",

    "levelAdvanced": "Просунутий",
    "levelIntermediate": "Середній",
    "levelBeginner": "Початковий",

    "coverLetterPart1": "СУПРОВІДНИЙ",
    "coverLetterPart2": "ЛИСТ",

    "workingExperience": "Досвід роботи",
    "education": "Освіта",

    "present": "Теперішній час",

    "work1PosName": "Full-Stack розробник",
    "work1Name": "AVAIT UG",
    "work1About": "Розробка фронтенд- та бекенд-компонентів для комплексного веб-додатку. Це включає створення адаптивних інтерфейсів користувача за допомогою сучасних фреймворків, а також забезпечення їх інтеграції з серверною архітектурою. Оптимізація та налаштування баз даних для ефективного зберігання та отримання даних, а також впровадження надійних заходів безпеки для захисту конфіденційної інформації. Розробка функціональних елементів, таких як інтерактивні форми, динамічне завантаження контенту та зручна навігація, для покращення загального користувацького досвіду.",

    "work2PosName": "Фронтенд-розробник",
    "work2Name": "IT-TUTOR",
    "work2About": "Розробка фронтенду веб-додатку з особливим акцентом на проєктуванні та реалізації зручних UI-компонентів, які забезпечують оптимальний користувацький досвід. Особлива увага приділяється адаптивному дизайну, що дозволяє пристосувати додаток для роботи на смартфонах, планшетах і комп'ютерах із збереженням високої функціональності та естетики. Також реалізовано механізми для безпечної обробки даних на стороні клієнта, що забезпечує захист даних і конфіденційність користувачів.",

    "work3PosName": "Стажер (Фронтенд)",
    "work3Name": "Foodba",
    "work3About": "Розробка фронтенду веб-додатку з акцентом на створенні інтуїтивно зрозумілого та привабливого інтерфейсу, який забезпечує позитивний користувацький досвід. Це включає проєктування та реалізацію дизайну, створення єдиного візуального стилю та застосування принципів UX. Особлива увага приділяється функціональним елементам додатку, таким як інтерактивні компоненти, форми, елементи навігації та динамічний контент, які покращують і підтримують загальну функціональність веб-додатку.",

    "edu1PosName": "Студент, Т-Курс",
    "edu1Name": "Studienkolleg Hamburg",
    "edu1About": "Закінчення підготовчого коледжу з успішним складанням вступного іспиту (FSP), який є кваліфікацією для початку навчання у вузі в Німеччині. Т-Курс орієнтований на підготовку до майбутнього навчання. Знання німецької мови поглиблюються до академічного рівня, щоб успішно завершити курс німецькою мовою. Крім того, приділяється велика увага вивченню основ математики, фізики та інформатики.",

    "edu2PosName": "Розробник ПЗ",
    "edu2Name": "IT-Академія 'Step'",
    "edu2About": "Отримання диплома розробника програмного забезпечення з поглибленим вивченням сучасних мов програмування та технологій. Це включає розробку веб-додатків за допомогою JavaScript, HTML і CSS, програмних рішень на C++ та додатків на основі C# та .NET. Також вивчалася серверна розробка за допомогою Node.js і фронтенд-розробка з Angular і React. Спеціалізація була спрямована на програмування на Java та розробку Android-додатків, що забезпечило міцні навички для створення сучасних програмних рішень.",

    "edu3PosName": "Учень",
    "edu3Name": "Гімназія №31, Запоріжжя",
    "edu3About": "Закінчення шкільного навчання з успішним освоєнням математики, природничих наук, мов та інформатики. У процесі шкільного навчання були розвинені важливі соціальні та організаційні навички, які стали основою для подальшої академічної та професійної кар'єри."
  },
  "projects": {
    "myProjectsPart1": "MY",
    "myProjectsPart2": "PROJECTS",
    "viewProjBtn": "ПЕРЕГЛЯНУТИ ПРОЄКТ",

    "proj1Name": "QStarr",
    "proj1About": "Платформа для контролю якості послуг допомагає компаніям автоматизувати перевірку виконаних робіт та збір зворотного зв'язку. Система включає конструктор налаштовуваних звітних форм, який можна використовувати як для внутрішньої звітності співробітників, так і для збору відгуків від клієнтів. Особливістю платформи стала інтеграція геолокації та фотофіксації: виконавці прикріплюють фотографії об'єкта з автоматичною прив'язкою до місця виконання роботи, що повністю виключає можливість фальсифікації даних. Також у системі реалізовано механізм автоматичних нагадувань про необхідність проведення регулярних перевірок, таких як технічне обслуговування обладнання або планові інспекції. Це дозволяє підвищити прозорість робіт, забезпечити достовірність даних та своєчасно виконувати всі заплановані перевірочні заходи.",

    "proj2Name": "IT-Tutor",
    "proj2About": "Онлайн-сервіс IT-курсів, який пропонує широкий вибір навчальних матеріалів та інтерактивних курсів з різних IT-тем. Зручна платформа допомагає як новачкам, так і досвідченим користувачам покращити свої технічні навички.",

    "proj3Name": "HoneyTools",
    "proj3About": "Платформа для автоматизації бізнес-процесів та бухгалтерського обліку є комплексним рішенням, яке забезпечує централізоване зберігання та обробку даних із можливістю автоматизованого імпорту інформації з електронних таблиць Excel до структурованої бази даних. Ключовою особливістю системи є реалізація інструментів моніторингу угод, включаючи можливість додавання контактної інформації контрагентів, супровідних документів та відстеження етапів виконання, а також комплекс бухгалтерської звітності з функціоналом автоматичного розрахунку податків та аналізу фінансових показників. Впровадження цього рішення дозволило мінімізувати кількість помилок при перенесенні інформації, підвищити прозорість бізнес-процесів та забезпечити оперативний доступ до актуальної фінансової звітності.",

    "proj4Name": "Vision of life",
    "proj4About": "AI-платформа для автоматичного створення бізнес-планів, яка перетворює початкові ідеї користувачів у готові інвестиційні проекти. Система використовує потужні нейромережеві алгоритми для аналізу введених користувачем концепцій, на основі чого пропонує кілька перспективних напрямків розвитку бізнесу. Кожен з запропонованих варіантів супроводжується детальними розрахунками ключових показників, включаючи оцінку ринкового потенціалу, необхідних інвестицій та прогнозованої рентабельності. Після вибору оптимального варіанту платформа автоматично формує повноцінний структурований бізнес-план, який містить усі стандартні розділи: від опису продукту та аналізу ринкової кон'юнктури до детальної фінансової моделі з прогнозами доходів, витрат, cash-flow та точками беззбитковості на період від 1 до 5 років. Завершальним етапом роботи системи є автоматичне формування професійно оформленого PDF-документа з підтримкою корпоративного стилю, інтерактивними діаграмами та візуалізаціями даних, що дозволяє використовувати його для презентації інвесторам, банкам або потенційним партнерам.",

    "proj5Name": "Frion",
    "proj5About": "Frion — це платформа для вигаданого притулку для тварин, яка пропонує різноманітні послуги, пов'язані з домашніми тваринами. Користувачі можуть реєструвати тварин для усиновлення, здавати знайдених тварин або запитувати лікування для своїх улюбленців. Сайт також надає вибір товарів для тварин і можливість знайти найближчі екстрені притулки. Усі запити підтверджуються через месенджер, електронну пошту або телефон. Платформа підтримує кілька мов і пропонує зручний інтерфейс для любителів тварин.",

    "proj6Name": "CB-Shchus",
    "proj6About": "Сайт для конструкторського бюро, який поєднує презентацію готових проектів та зручний інструмент для оформлення замовлень. На платформі реалізовано інтерактивний каталог виконаних робіт з фільтрацією за галузями та технологіями, що дозволяє клієнтам швидко оцінити експертизу компанії. Ключова особливість — система онлайн-замовлення: користувачі можуть створити індивідуальний проект за допомогою покрокового конструктора, завантажити технічні вимоги та одразу отримати попередній розрахунок вартості. Для співробітників бюро доступний закритий розділ з автоматичним розподілом заявок та відстеженням статусів виконання."
  },
  "contactPage": {
    "contactMePart1": "ЗВ'ЯЖІТЬСЯ",
    "contactMePart2": "ЗІ МНОЮ",

    "getInTouch": "Зв'язатися",
    "contactText": "Якщо у вас є до мене запитання, залиште свої контактні дані та повідомлення у формі, і я з радістю вам відповім! Давайте разом перетворимо складні завдання на успішні цифрові рішення!",

    "fieldName": "Ім'я",
    "fieldNamePlacehold": "Введіть ваше ім'я ...",
    "fieldNameErr": "Ім'я необхідне",

    "fieldEmail": "Ел. пошта",
    "fieldEmailPlacehold": "Введіть вашу пошту ...",
    "fieldEmailErr": "Ел. пошта необхідна",
    "fieldEmailErrFormat": "Неправильний формат ел. пошти",

    "fieldSubject": "Тема",
    "fieldSubjectPlacehold": "Введіть тему ...",
    "fieldSubjectErr": "Тема необхідна",

    "fieldMessage": "Повідомлення",
    "fieldMessagePlacehold": "Введіть повідомлення ...",
    "fieldMessageErr": "Повідомлення необхідно",

    "sendMessageBtn": "НАДІСЛАТИ ПОВІДОМЛЕННЯ",
    "loadingMessageBtn": "ЗАВАНТАЖЕННЯ"
  }
}
